## Missing Values

In [1]:
import warnings
warnings.filterwarnings('ignore')

import math
import numpy as np

print(np.divide(8,4))
print(np.divide(0,0))
print(np.log(-1))
print(np.sqrt(-2))
print(math.inf * 0)
print(math.inf/math.inf)

2.0
nan
nan
nan
nan
nan

In [2]:
import pandas as pd
A = [10, 100, 120, np.sqrt(-12)]
B = [20, 40, 128, 90]
C = [20, None, 128, None]
D = [15, 0, 0, -10]

data = {'A': A, 'B': B, 'C':C, 'D':D}
df = pd.DataFrame(data)
display(df)

       A    B      C   D
0   10.0   20   20.0  15
1  100.0   40    NaN   0
2  120.0  128  128.0   0
3    NaN   90    NaN -10

In [3]:
df.isna().sum()

A    1
B    0
C    2
D    0
dtype: int64

In [4]:
df.isnull().sum()

A    1
B    0
C    2
D    0
dtype: int64

In [5]:
df.notnull().sum()

A    3
B    4
C    2
D    4
dtype: int64

In [6]:
np.isnan(df).sum()

A    1
B    0
C    2
D    0
dtype: int64

In [7]:
np.isnan(df).sum().sum()

3

In [8]:
df.isna().sum().sum()

3

In [9]:
df.dropna(axis=0)

       A    B      C   D
0   10.0   20   20.0  15
2  120.0  128  128.0   0

In [10]:
df.dropna(axis=1)

     B   D
0   20  15
1   40   0
2  128   0
3   90 -10

In [11]:
#display(df)

# to drop is non NaN is less than three
df.dropna(axis=0, thresh=3)

       A    B      C   D
0   10.0   20   20.0  15
1  100.0   40    NaN   0
2  120.0  128  128.0   0

In [12]:
display(df)

# to drop is non NaN is less than four
df.dropna(axis=0, thresh=4)

       A    B      C   D
0   10.0   20   20.0  15
1  100.0   40    NaN   0
2  120.0  128  128.0   0
3    NaN   90    NaN -10

       A    B      C   D
0   10.0   20   20.0  15
2  120.0  128  128.0   0

In [13]:
display(df)
df.fillna(method='ffill', axis=0)

       A    B      C   D
0   10.0   20   20.0  15
1  100.0   40    NaN   0
2  120.0  128  128.0   0
3    NaN   90    NaN -10

       A    B      C   D
0   10.0   20   20.0  15
1  100.0   40   20.0   0
2  120.0  128  128.0   0
3  120.0   90  128.0 -10

In [14]:
display(df)
df.fillna(method='ffill', axis=1)

       A    B      C   D
0   10.0   20   20.0  15
1  100.0   40    NaN   0
2  120.0  128  128.0   0
3    NaN   90    NaN -10

       A      B      C     D
0   10.0   20.0   20.0  15.0
1  100.0   40.0   40.0   0.0
2  120.0  128.0  128.0   0.0
3    NaN   90.0   90.0 -10.0

In [15]:
display(df)
df.fillna(method='bfill', axis=0)

       A    B      C   D
0   10.0   20   20.0  15
1  100.0   40    NaN   0
2  120.0  128  128.0   0
3    NaN   90    NaN -10

       A    B      C   D
0   10.0   20   20.0  15
1  100.0   40  128.0   0
2  120.0  128  128.0   0
3    NaN   90    NaN -10

In [16]:
display(df)
df.fillna(method='bfill', axis=1)

       A    B      C   D
0   10.0   20   20.0  15
1  100.0   40    NaN   0
2  120.0  128  128.0   0
3    NaN   90    NaN -10

       A      B      C     D
0   10.0   20.0   20.0  15.0
1  100.0   40.0    0.0   0.0
2  120.0  128.0  128.0   0.0
3   90.0   90.0  -10.0 -10.0

In [17]:
df.fillna(value=10)

       A    B      C   D
0   10.0   20   20.0  15
1  100.0   40   10.0   0
2  120.0  128  128.0   0
3   10.0   90   10.0 -10

## Duplicated Recocrds

In [18]:
import pandas as pd
A = ['a', 100, 120, 10]
B = ['b', 40, 128, 90]
C = ['c', None, 128, None]
D = ['d', 10, 0, -10]
E = ['a', 100, 120, 10]
F = ['a', 100, 120, 0]
data = {'A': A, 'B': B, 'C':C, 'D':D, 'E':E, 'F':F}
df = pd.DataFrame.from_dict(data, orient='index').reset_index(drop=True)
df.rename(columns={0:'A', 1:'B', 2:'C', 3:'D'}, inplace=True)
display(df)

   A      B    C     D
0  a  100.0  120  10.0
1  b   40.0  128  90.0
2  c    NaN  128   NaN
3  d   10.0    0 -10.0
4  a  100.0  120  10.0
5  a  100.0  120   0.0

In [19]:
df[df.duplicated()]

   A      B    C     D
4  a  100.0  120  10.0

In [20]:
df[df.duplicated(['A', 'B', 'C'])]

   A      B    C     D
4  a  100.0  120  10.0
5  a  100.0  120   0.0

In [21]:
df[df.duplicated(['A', 'B', 'D'])]

   A      B    C     D
4  a  100.0  120  10.0

In [22]:
df.drop_duplicates()

   A      B    C     D
0  a  100.0  120  10.0
1  b   40.0  128  90.0
2  c    NaN  128   NaN
3  d   10.0    0 -10.0
5  a  100.0  120   0.0

In [23]:
df.drop_duplicates(['A', 'B', 'C'])

   A      B    C     D
0  a  100.0  120  10.0
1  b   40.0  128  90.0
2  c    NaN  128   NaN
3  d   10.0    0 -10.0

In [24]:
df.drop_duplicates(['A', 'B', 'D'])

   A      B    C     D
0  a  100.0  120  10.0
1  b   40.0  128  90.0
2  c    NaN  128   NaN
3  d   10.0    0 -10.0
5  a  100.0  120   0.0